export const SITE_NAME = "Твоя кухня";
export const CLIENT_URL = "https://youkuhnya.ru";

export const pagesData: IPages = {
  main: {
    name: CLIENT_URL,
    title: "Кухни на заказ в Москве от производителя. Кухни с гарантией 10 лет",
    description:
      "Кухни на заказ по индивидуальным размерам без наценок. Долговечная немецкая и австрийская фурнитура. Срок изготовления 10-20 дней. Бесплатный 3D проект кухни и визуализация за 4 часа. Запишитесь на замер и расчет стоимости.",
    keywords:
      "белорусские кухни +на заказ +в москве, белорусские кухни +от производителя +в москве, бюджетные кухни +на заказ +в москве, виват кухни купить +в москве рассрочку, встраиваемая кухня +на заказ недорого москва, встраиваемые кухни +на заказ москва, встроенная кухня +на заказ недорого москва, встроенные кухни +на заказ москва, где купить кухню +в москве +от производителя, готовая кухня недорого +от производителя москва, готовые кухни +от производителя москва, деревянные кухни +от производителя москва, дешевые кухни +в москве под заказ, дешевые кухни +на заказ +в москве, дешевые кухни +на заказ +в москве эконом, дешевые кухни +на заказ москва цены, заказ кухни +в москве рядом, заказ кухни москва московские кухни, заказ мебели кухни москве недорого, заказать кухню +в москве недорого +от производителя, заказать кухню +в рассрочку, заказать кухню +на заказ +в москве, заказать кухню +от производителя +в москве, заказать кухню недорого +в рассрочку, изготовить кухню +на заказ +в москве, изготовление кухни +на заказ +в москве, изготовление кухни +по индивидуальному заказу +в москве, изготовление кухни под заказ недорого +в москве, качественные кухни +на заказ +в москве, качественные кухни +от производителя +в москве, классические кухни +на заказ москва, компания кухни +на заказ отзывы москва, купить дешевую кухню +в москве +от производителя, купить кухни эконом +от производителя москва, купить кухню +в москве +от производителя, купить кухню +в москве +от производителя цены, купить кухню +в рассрочку, купить кухню +в рассрочку +в москве, купить кухню +в рассрочку банка, купить кухню +в рассрочку без банка, купить кухню +на заказ +в москве, купить кухню +на заказ +в москве недорого, купить кухню под заказ москва, купить угловую кухню +в москве +от производителя, кухни +в москве +от производителя каталог, кухни +в рассрочку +в москве, кухни +в рассрочку +на заказ москве, кухни +в рассрочку +с доставкой, кухни +в рассрочку без, кухни +в рассрочку без процентов, кухни +в рассрочку без процентов +в москве, кухни +и шкафы +на заказ москва, кухни +из массива +на заказ +в москве, кухни +из мдф +от производителя +в москве, кухни +на заказ +в железнодорожном московской области, кухни +на заказ +в можайске московской области, кухни +на заказ +в москве, кухни +на заказ +в москве лучшие компании, кухни +на заказ +в москве мосмирмебели, кухни +на заказ +в москве цены, кухни +на заказ +в московской области, кухни +на заказ +в пушкино московской, кухни +на заказ +в пушкино московской области, кухни +на заказ +в рассрочку, кухни +на заказ +в троицке новая москва, кухни +на заказ +от производителя москва, кухни +на заказ +по индивидуальным проектам москва, кухни +на заказ без посредников москва, кухни +на заказ мария москва, кухни +на заказ москва +и московская область, кухни +на заказ москва 500 кухонь, кухни +на заказ москва deshevaya mebel ru, кухни +на заказ москва авито, кухни +на заказ москва недорого +от производителя, кухни +на заказ москва сайт, кухни +на заказ москва фабрика, кухни +на заказ москва фото +и цены, кухни +на заказ недорого +в москве каталог, кухни +на заказ недорого +в москве маленькие, кухни +на заказ недорого москва +и область, кухни +на заказ недорого москва цены, кухни +на заказ недорого московская область, кухни +на заказ новая москва, кухни +на заказ отзывы покупателей москва, кухни +на заказ официальный сайт москва, кухни +на заказ раменское московская область, кухни +на заказ стильные кухни москва, кухни +на заказ фото москва, кухни +на заказ эконом класса москва, кухни +от производителей +в москве +и области, кухни +от производителя +в москве, кухни +от производителя +в москве +и московской, кухни +от производителя москва пластик, кухни +от производителя фабрика +в москве, кухни +от производителя цены москва, кухни +по индивидуальному заказу москва, кухни +по индивидуальному заказу недорого москва, кухни дешево +от производителя москва, кухни заказ москве области, кухни заказ недорого московский, кухни зов рассрочка, кухни мария +в москве +от производителя, кухни мария рассрочка, кухни массив москва производитель, кухни мдф +на заказ +в москве, кухни москва +от производителя распродажа, кухни недорого +в москве +от производителя, кухни недорого +в москве +от производителя прямые, кухни недорого +в москве +от производителя угловые, кухни недорого +в рассрочку +в москве, кухни пенза +от производителя +в москве, кухни под заказ +в москве, кухни под заказ +в москве +от производителя, кухни под заказ +в москве недорого, кухни под заказ +в москве фабрика недорого, кухни под заказ москва цены, кухни под заказ московская область, кухни россии +в москве +от производителя, кухни троицк москва +на заказ, кухни угловые под заказ москва, кухни цены рассрочка, кухни эконом класса +от производителя москва, кухня +в рассрочку, кухня +в рассрочку +в москве +от производителя, кухня +в рассрочку +от магазина москва, кухня +в рассрочку банка, кухня +в рассрочку без банка, кухня +в рассрочку без банка москва, кухня +в рассрочку без первоначального, кухня +в рассрочку без первоначального взноса, кухня +из пластика +на заказ +в москве, кухня +на заказ +по индивидуальным размерам москва, кухня +на заказ +по размерам +в москве, кухня +на заказ кухни home россия москва, кухня +на заказ недорого москва отзывы, кухня +на заказ недорого рассрочка, кухня купить +в москве недорого +от производителя, кухня мебель рассрочка, кухня под заказ +в рассрочку, кухня рассрочку производителя, кухня эконом +от производителя москва, кухня эконом недорого +от производителя москва, леруа кухни +на заказ москва, леруа кухни +на заказ москва каталог, леруа мерлен кухни +на заказ москва, леруа мерлен кухня +в рассрочку, лучшие кухни +на заказ +в москве, магазин кухонь +от производителя москва, маленькая кухня +на заказ москва, мебель +для кухни +на заказ +в москве, мебель +для кухни +от производителя москва, мебель кухни +от производителя недорого москва, московские кухни +на заказ, московские кухни +на заказ отзывы, московские кухни +на заказ отзывы покупателей москва, недорогая кухня рассрочку кухня рассрочку, недорогие кухни +в москве +от производителя распродажа, недорогие кухни +в москве +от производителя рейтинг, недорогие кухни +на заказ +в москве, недорогие кухни производителя москве цены, немецкие кухни +на заказ +в москве, новые фасады +для кухни +на заказ москва, премиальные кухни +на заказ москва +от производителя, премиум кухни +на заказ москва, производство кухни +на заказ +в москве, прямые кухни +на заказ +в москве, расчет кухни +на заказ онлайн калькулятор москва, рейтинг кухонь +на заказ +в москве, российские кухни +от производителя +в москве, ру кухни +на заказ москва, сделать кухню +на заказ +в москве, современные кухни +на заказ +в москве, средняя стоимость кухни +на заказ +в москве, средняя цена кухни +на заказ +в москве, стильные кухни под заказ москва, стильные кухни рассрочка, стоимость кухни +на заказ +в москве, тема кухни кухни +на заказ +в москве, топ 10 производителей кухонь +в москве, угловые кухни +на заказ москва, угловые кухни +на заказ недорого москва, угловые кухни +от производителя москва, угловые кухни рассрочку, фабрика кухни +в москве +от производителя каталог, фасады +для кухни +на заказ +в москве, фасады кухни +от производителя москва, фасады массив +для кухни +от производителя москва, хофф кухни +на заказ москва, элитные кухни +на заказ +в москве, изготовление кухонных гарнитуров +на заказ, купить кухонный гарнитур +на заказ, кухонные гарнитуры +на заказ фото цены, кухонный гарнитур +на заказ, кухонный гарнитур +на заказ москва, кухонный гарнитур +на заказ недорого, кухонный гарнитур +на заказ фото, кухонный гарнитур +на заказ цены, кухонный гарнитур под заказ, кухонный гарнитур под заказ цены, маленькие кухонные гарнитуры заказ, сколько стоит кухонный гарнитур +на заказ",
    type: "website",
    url: CLIENT_URL,
  },
  portfolio: {
    name: `portfolio`,
    title:
      "Каталог кухонь на заказ. Готовые проекты, цены и описания | Твоя кухня",
    description:
      "Каталог кухонь на заказ с ценами и подробным описанием от фабрики «Твоя Кухня». Материалы, ассортимент фасадов и дизайн проекты. Сравните цены и получите консультацию дизайнера.",
    keywords:
      "каталог кухонь твоя кухня, кухни москва каталог отзывы, becker кухни москва каталог, becker кухни москва каталог +и цены, happy kitchen кухни москва каталог, happy kitchen кухни москва каталог +и цены, hoff кухни цены +в москве каталог, nova кухни москва каталог +и цены, zetta кухни официальный сайт москва каталог, анонс кухни официальный сайт москва каталог, антарес кухни каталог москва, антарес кухни москва каталог +и цены, бауцентр +в москве каталог кухни капучино, бежевая кухня примеры, белорусские кухни +в москве каталог +и цены, белорусские кухни +в москве официальный сайт каталог, белорусские кухни зов +в москве каталог, белорусские кухни каталог москва, белые кухни примеры, бест мебель кухни каталог +с ценами москва, бобр кухни официальный сайт москва каталог, высокая кухня примеры, дом кухни москва каталог, дом кухни москва каталог +и цены, зов кухни каталог москва, икеа кухни каталог москва 2021, икеа кухни каталог москва купить, икеа кухня каталог москва, икеа москва каталог мебели +для кухни, каталог кухни фото москве, каталог мебели +для кухни недорого москва, каталог мебели кухни москва, купить кухню +в леруа москва каталог, купить кухню +в москва каталог товаров, купить кухню хофф +в москве каталог, куплю кухню москва каталог, кухни +в магазине хофф москва каталог, кухни +в мерлен каталог москва, кухни +в москве +от производителя каталог, кухни +в москве официальный сайт каталог цены, кухни +в москве сайты каталог, кухни +в москве сайты каталог товаров, кухни +в хофф москва каталог +и цены, кухни +на заказ москва каталог +и цены, кухни +на заказ недорого +в москве каталог, кухни 7 м пример, кухни hoff каталог москва, кухни ru мебель москва каталог, кухни анонс каталог москва, кухни беккер +в москве каталог, кухни беккер +в москве каталог +с ценами, кухни беккер москва официальный сайт каталог, кухни беларуси официальный сайт москва каталог, кухни белоруссии +в москве каталог, кухни белоруссии +в москве каталог +и цены, кухни белоруссии официальный сайт каталог москва, кухни браво официальный сайт каталог цены москва, кухни виват москва каталог, кухни виват официальный сайт каталог москва, кухни виват официальный сайт каталог цены москва, кухни вирс официальный сайт +в москве каталог, кухни даром официальный сайт каталог москва, кухни дешево москва каталог +и цены, кухни дятьково каталог +с ценами москва, кухни дятьково официальный сайт каталог цены москва, кухни зетта каталог москва, кухни зов каталог +с ценами +в москве, кухни зов официальный сайт +в москве каталог, кухни зов примеры, кухни икеа каталог москва цены, кухни каталог товаров +в москве, кухни каталог товаров +и цены москва, кухни каталог фото цены готовые москва, кухни купить каталог цен +в москве, кухни лебеди каталог москва, кухни лебеди москва каталог +и цены, кухни лебеди москва каталог +и цены фото, кухни лебеди москва каталог адрес магазина, кухни леруа мерлен каталог +с ценами москва, кухни мария каталог +с ценами +в москве, кухни мария каталог фото +и цены москва, кухни мария москва каталог, кухни москва каталог, кухни москва каталог +и цены, кухни москва каталог +и цены готовые, кухни москва каталог +и цены недорого, кухни москвы официальный сайт каталог, кухни нонтон +в москве каталог, кухни оби каталог москва, кухни официальный сайт каталог распродажа москва, кухни пенза +в москве каталог цены, кухни примеры дизайна маленькой, кухни примеры интерьеров угловые, кухни примеры цветов фото, кухни ренессанс москва каталог, кухни ренессанс москва каталог фото +и цены, кухни ру каталог москва, кухни сайт каталог цены +в москве, кухни столплит каталог москва фото +и цены, кухни столплит москва каталог, кухни стоплинг каталог +и цены москва, кухни стоплит ру москва каталог, кухни форема +в москве каталог, кухни форема +в москве каталог официальный, кухни форема официальный сайт +в москве каталог, кухни фото каталоги цены москва, кухни хофф каталог москва распродажа, кухни хофф каталог угловые москва недорого, кухни хофф каталог фото +и цены москва, кухни хофф каталог цены москва недорого, кухни хофф москва каталог фото, кухня +на заказ +в москве каталог, кухня +на заказ пример, кухня 6 метров пример, кухня гостиная примеры фото интерьера, кухня зетта официальный сайт москва каталог, кухня каталог недорого москва, кухня леруа примеры, кухня мария официальный сайт москва каталог, кухня примеры дизайна, кухня угловая каталог фото цены москва, кухонный двор кухни каталог фото цены москва, лазурит кухни каталог фото +и цены москва, леруа каталог кухни москва, леруа кухни +на заказ москва каталог, леруа кухни модульные каталог москва, леруа кухни москва каталог +и цены, леруа мерлен каталог кухни готовые москва, леруа мерлен каталог кухни угловые москва, леруа мерлен каталог кухни фото москва, леруа мерлен каталог товаров +в москве кухни, леруа мерлен москва каталог кухонь, леруа москва каталог обоев +для кухни, леруа москва кухни каталог товаров, магазин кухни +в москве недорого каталог, мебель +для кухни москва каталог фото, мебель кухни интернет каталога москва, мебель кухни каталог +с ценами москва, мебель кухня каталог фото цены москва, мебель хофф москва каталог кухни, мебель169 ру каталог цены москва кухни, много мебели кухни каталог москва, много мебели кухни каталог цены москва, модульные кухни каталог москва, модульные кухни леруа мерлен каталог москва, москва мебель 169 ru кухни каталог, московские кухни официальный сайт москва каталог, недорого купить кухню +в москве каталог, нонтон кухни москва каталог +и цены, нонтон мебель москва каталог +и цены кухни, оби кухня каталог цены москва, обои +для кухни леруа мерлен каталог москва, пример большой кухни, пример интерьера кухни гостиной, пример кухни +в хрущевке, пример кухни +на даче, пример кухни +с холодильником, пример кухни 15 кв, пример кухни 15 кв м, пример кухни 2 метра, пример кухни 3 метра, пример кухни 6 кв, пример кухни 6 кв м, пример кухни 8 кв м, пример кухни гарнитур, пример кухни гостиной, пример кухни пик, пример кухни столовой, пример кухонь 5 кв м, пример кухонь черно белых, пример небольшой кухни, пример обстановки кухни, пример планировки кухни гостиной, пример стоимости кухни, примеры гостиной +с кухней +в доме, примеры готовых кухонь, примеры квадратных кухонь, примеры красивой кухни, примеры кухни +в деревянном доме, примеры кухни +в панельном доме, примеры кухни +в современном стиле, примеры кухни +в частном доме, примеры кухни 10 кв, примеры кухни 10 кв м, примеры кухни 12 кв м, примеры кухни 8 кв, примеры кухни гостиной +в современном стиле, примеры кухни гостиной +в частном доме, примеры кухни кухонных гарнитуров, примеры кухни остров, примеры кухонь +в хрущевке 5 кв м, примеры кухонь +в хрущевке фото, примеры кухонь +с барной стойкой, примеры кухонь +с окном, примеры кухонь +с плитой, примеры кухонь +с углом, примеры кухонь +с ценами, примеры кухонь леруа мерлен, примеры кухонь лофт, примеры кухонь реальные, примеры кухонь со встроенной техникой, примеры кухонь студий, примеры кухонь фото, примеры маленьких кухонь, примеры маленькой кухни фото, примеры маленькой угловой кухни, примеры мебели кухни, примеры оформления кухни, примеры п образных кухонь, примеры прямой кухни, примеры прямых кухонь 3 метра, примеры расположения кухни, примеры светлой кухни, примеры серой кухни, примеры современных кухонь фото, примеры угловых кухонь, примеры угловых кухонь +с размерами, примеры угловых кухонь фото, примеры угловых кухонь фото +в интерьере, примеры фартуков +для кухни, примеры хороших кухонь, примеры цвета кухонь, примеры цветов кухни, проект кухни пример, серо белая кухня примеры, стильные кухни каталог +с ценами +в москве, стильные кухни каталог москва официальный, стильные кухни москва каталог, стильные кухни москва каталог фото, стильные кухни москва каталог фото +и цены, стильные кухни официальный каталог цены москва, стильные кухни официальный сайт москва каталог, стильные кухни примеры кухонь, столешницы +для кухни каталог москва, столплит интернет магазин каталог москва кухни, столплит кухни каталог +с ценами москва, угловая кухня примеры дизайна, угловые кухни москва каталог +и цены, фабрика кухни +в москве +от производителя каталог, фабрика кухонь +в москве каталог +и цены, хофф каталог кухни недорогие +в москве, хофф каталог товаров москва кухни, хофф каталог товаров москва цены кухни, хофф кухни каталог москва, хофф кухни распродажа москва акция каталог, шатура кухни каталог +и цены +в москве, экспресс кухни +в москве каталог, эргономичная кухня примеры",
    url: `${CLIENT_URL}/portfolio`,
    type: "website",
  },
  articles: {
    name: "articles",
    title: "Полезные статьи про кухни",
    description:
      "Статьи о мебели для кухни: организация пространства, дизайн и стиль кухни, материалы, нюансы и тонкости проектирования. Рекомендации по выбору кухонной мебели на заказ, ответы на частые вопросы.",
    keywords:
      "Статьи про кухни, статьи про мебель, дизайн и стиль кухни, нюансы и тонкости проектирования, рекомендации по выбору кухонной мебели",
    url: `${CLIENT_URL}/articles`,
    type: "article",
  },

  advantages: {
    name: `preimushestva`,
    title: "Преимущества мебели фабрики Твоя кухня",
    description:
      "Кухонные гарнитуры и корпусная мебель от фабрики «Твоя Кухня». Характеристики, особенности, применяемые материалы. Выберите качественную и комфортную кухню, сделанную по индивидуальному проекту, и воспользуйтесь рассрочкой до 24 месяцев без первоначального взноса и переплат.",
    url: `${CLIENT_URL}/preimushestva`,
    type: "website",
  },
  furniture: {
    name: `korpusnaya_mebel`,
    title: "Корпусная мебель на заказ в Москве",
    description:
      "Качественная мебель на заказ от производителя. Мебель по индивидуальным размерам и проектам по доступным ценам в Москве. Шкафы, прихожие, гардеробные и другая мебель с максимальной выгодой.",
    keywords:
      "Мебель на заказ,Изготовление мебели на заказ, Мебель по индивидуальному заказу, Заказ мебели по размерам, Мебель под заказ, Мебель на заказ по индивидуальным размерам, Корпусная мебель на заказ, Заказ мебели по размерам недорого, Мебель на заказ в Москве, Мебель для ванной на заказ, Мебель на заказ комната, Детская мебель на заказ, Мебель для гостиной, Мебель на заказ недорого Москва, Мебель на заказ область, Встраиваемая мебель на заказ, Встроенная мебель на заказ, Производство мебели на заказ, Мебель на заказ фото, Заказ мебели по размеру недорого Москва",
    url: `${CLIENT_URL}/korpusnaya_mebel`,
    type: "website",
  },
  discounts: {
    name: `discounts`,
    title: "Акции и скидки на мебель и кухонные гарнитуры",
    description:
      "Актуальный каталог акций и скидок на кухни и корпусную мебель в Москве. Узнай как выгодно приобрести кухонный гарнитур или другую мебель на заказ. Подарки и техника новым клиентам фабрики «Твоя кухня».",
    keywords:
      "акции скидки кухня, кухни купить акции скидки, кухни акция москва скидки, кухни скидки акции распродажи, акции кухня со скидкой, купить кухню +по акции со скидкой, стильные кухни акции скидки, бытовая техника +для кухни акции скидки, встраиваемая техника +для кухни скидки акции, кухня мария скидки акции, кухни скидки акции распродажи москва, кухни зов скидки акции, скидки +и акции +на технику +для кухни, кухни со скидкой, скидки +на кухни, кухни купить скидки, купить кухню со скидкой, кухни скидки москва, кухни распродажа скидки, кухни со скидкой +в москве, цена кухни кухни скидки, кухни со скидкой распродажа, купить кухню скидки москва, кухни марии скидки, купить кухню со скидкой москва, мебель кухня скидки, распродажа кухонь москва скидки, кухня заказ скидка, кухни распродажа образцов скидки, скидки +на технику +для кухни, техника +для кухни со скидкой, стильные кухни скидка, мамина кухня скидки, кухни со скидкой распродажа москва, бытовая техника +для кухни скидки, встроенная кухня скидки, готовые кухни скидки, кухни магазин скидки, встраиваемая техника +для кухни скидки, встроенная техника +для кухни скидки, недорогие кухни скидки",
    url: `${CLIENT_URL}/discounts`,
    type: "website",
  },
  contacts: {
    name: `contacts`,
    title: "Контакты | Твоя кухня",
    description:
      "Контакты, адреса офисов и способы связи с мебельной фабрикой Твоя кухня. Телефоны e-mail и др.",
    keywords:
      "контакты твоя кухня, мебельная фабрика твоя кухня контакты, реквизиты твоя кухня, адрес офиса фабрики твоя кухня, адрес офиса твоя кухня в москве, фабрика твоя кухня адрес, способы связи твоя кухня, твоя кухня адрес, твоя кухня социальные сети, мебель твоя кухня контакты, твоя кухня москва адрес, твоя кухня телефоны, телефон фабрики твоя кухня, телефон мебельной фабрики твоя кухня, клиентская поддержка твоя кухня, позвонить твоя кухня мебельная фабрика, твоя кухня позвонить, адрес и контакты твоя кухня",
    url: `${CLIENT_URL}/contacts`,
    type: "website",
  },
};

export const links: ILink = {
  vk: "https://vk.com/youkuhnya",
  tgChat: "https://t.me/LevitinTvoyaKuhnya",
  tgGroup: "https://t.me/youkuhnya",
  whatsapp: "https://wa.me/79804160380",
  tel: "tel:+74959885528",
  phone: "+7 (495) 988-55-28",
  mailTo: "mailto:info@youkuhnya.ru",
  email: "info@youkuhnya.ru",
};

export const pagesLinks = {
  main: "/",
  howWeWork: "#how-we-work",
  discounts: "/discounts",
  reviews: "/#reviews",
  articles: "/articles",
  portfolio: "/portfolio",
  advantages: "/preimushestva",
  furniture: "/korpusnaya_mebel",
  contacts: "/contacts",
  admin: "/admin",
  adminClaims: "/admin/claims",
  adminDiscounts: "/admin/discounts",
  adminAdmins: "/admin/admins",
  adminAdminsNew: "/admin/admins/new",
  adminDiscountsNew: "/admin/discounts/new",
  adminKitchens: "/admin/kitchens",
  adminFurniture: "/admin/furniture",
  adminFurnitureNew: "/admin/furniture/new",
  adminKitchensNew: "/admin/kitchens/new",
  adminReviews: "/admin/reviews",
  adminReviewsNew: "/admin/reviews/new",
  adminTeam: "/admin/team",
  adminTeamNew: "/admin/team/new",
  adminArticles: "/admin/articles",
  adminArticlesNew: "/admin/articles/new",
  adminGallery: "/admin/gallery",
  adminGalleryNew: "/admin/gallery/new",
  adminLogin: "/admin/login",
};

interface ILink {
  [name: string]: string;
}
interface IPage {
  name: string;
  title: string;
  description: string;
  keywords?: string;
  url: string;
  type?:
    | "website"
    | "article"
    | "book"
    | "profile"
    | "music.song"
    | "music.album"
    | "music.playlist"
    | "music.radio_station"
    | "video.movie"
    | "video.episode"
    | "video.tv_show"
    | "video.other"
    | undefined;
}
interface IPages {
  [page: string]: IPage;
}
